/**
 * ============================================================
 *     GPV Viewer スタンドアロン版 メインスクリプト
 * ============================================================
 */

/**
 * - - - - - - - - - - - - - - - - - - - -
 * インポート
 * - - - - - - - - - - - - - - - - - - - -
 */

/** 共通関数 */

/** スタイル */
import './style.scss'

/**
 * - - - - - - - - - - - - - - - - - - - -
 * 定数
 * - - - - - - - - - - - - - - - - - - - -
 */

/**
 * - - - - - - - - - - - - - - - - - - - -
 * エントリポイント
 * - - - - - - - - - - - - - - - - - - - -
 */
const main = async () => {
  console.log('gpx-viewer-standalone')
  document.querySelector('.map_container').innerHTML =
    'GPX Viewer スタンドアロン版'
}
main()
